{
    "moves": [
        {
            "id": "Backslide, Pole Assisted",
            "category": [
                "transition"
            ],
            "common_mistakes": "Not Sliding Easily: If you aren’t sliding as easily as you’d like, there are two possibilities. The first is that your back is too close to the pole, or you are wearing clothes that make you too sticky. To get your back away from the pole, arch your back harder, leaning the very top of the soft muscle-y part of your back between the neck and shoulders (trapezius) against the pole. Some sticky polewear is great for gripping the pole, but it can be difficult to work in slides. Try wearing a t-shirt! Plain ol’ cotton really adds ease when working with lowflow moves like this. Struggling with Clean Leg Lines: If you are wearing heels, remember to keep your toes pointed properly even with the heels. Reach through the platform of the heel, rolling onto the tiny beveled lip at the front of the platform. If you are barefoot, push through the balls of your feet and keep your calves engaged. That will help you accentuate your lines, barefoot or in heels. Here’s a guide on how to properly point your toes.",
            "description": "The pole-assisted Backslide is a sexy, cheeky way to add a little flare to your pole routine, helping you get from the pole to the floor or transition into low spins. Adding wonderful shapes to your overall routine, this is a fun basic transition to sprinkle in, and it can be modified however you’d like for extra drama. Add a little body wave as you move down the pole, add in leg waves, or do it with (or without) heels for your own unique effect.",
            "difficulty": "introductory",
            "link": "https://polepedia.com/moves/backslide/",
            "names": [
                "Backslide, Pole Assisted",
                "Pole Slide",
                "Slide Down",
                "Sexy Sit"
            ],
            "points_of_contact": [
                5
            ],
            "prerequisites": [
                "Baseball Grip (lower hand modified)",
                "Pole Walk"
            ],
            "safety_tips": "Be sure not to hang loosely from your top arm. You should be using the very top of your shoulder to support your bodyweight, and keep top arm strong. You should not feel like you are hanging from your shoulder or arm here. Not only does this protect your joints, but you’ll find it gives you much more control!",
            "steps": "Start standing next to the pole. Grab the pole with your inside hand in a baseball grip. Walk around to the opposite side of the pole and rest your shoulder blades against the pole. Keep your hand high on the pole.Make sure your feet are a little away from the pole so you are leaning against the pole.Unpeel your heels so you are standing on the balls of your feet or on the platforms of your heels. Hang your free hand down and grab the pole comfortably, index finger pointing down.Look at the opposite side of the pole for dramatic effect. Arch your back and push the hips forward to start, leaning against the pole.Bend the knees and begin sliding down the pole. Keep your heels up away from the floor and rotate the booty out, towards the pole, as you slide."
        },
        {
            "id": "Pole Walk",
            "category": [
                "transition",
                "trick"
            ],
            "common_mistakes": "Clunky Steps or Loss of Balance: When you are ready to switch legs, be sure to shift your weight onto the leg that is firmly on the ground. For instance, if you just stepped forward with your inside foot, you then want to shift all your weight onto your inside leg before taking a step with your outside foot. Tripping Over Your Own Feet: Be sure to maintain a comfortable distance away from the pole so you don’t feel crowded as you take a step. When dragging your toes, try dragging them in a gentle, outward arc away from your body to help maintain your foot placement. Movement Looks Stiff: When you shift your weight onto the leg that is firmly on the ground, try tilting your hips heavily downwards to the leg that is stepping forward. Switch with each side. This will give you a lovely hip sway as you walk – and let your shoulders follow your hips’ pull gently, maintaining hand contact with the pole. You can also try dragging your toes with each step in a gentle arc.",
            "description": "​The Pole Walk is a classic way to move around the pole with grace and fluidity. Walking around the pole might seem simple, but adding the finesse of a graceful walk not only helps you train a strong sense of balance and a great toe point, but it provides breathing room in any pole dance routine, giving the audience a moment to look on in awe. The Pole Walk is an introductory pole trick that every beginner should have in their mental toolbox at the start of their journey, able to be performed on both static and spin poles.",
            "difficulty": "introductory",
            "link": "https://polepedia.com/moves/pole-walk/",
            "names": [
                "Pole Walk",
                "Walk-around",
                "Walk it out",
                "Step, step, step"
            ],
            "points_of_contact": [
                3
            ],
            "prerequisites": [
                "Baseball Grip (lower hand modified)"
            ],
            "safety_tips": "Don’t add pressure to the top of the toes while they are dragging across the floor. Always flip your toes back over to step down on the ball of your foot. Always be sure to firmly connect with the floor and shift your weight before stepping with the other foot.",
            "steps": "Start with your inside hand holding the pole firmly in a baseball grip high above your head. Push up onto the balls of your feet, engaging the whole leg. Maintain this posture. Shift your weight onto your inside leg. Step with your outside leg, bending the leg, and dragging the toes across the floor gently. Step down with the ball of your foot. Next, shift your weight onto your outside leg. Bend the inside leg and bring it forward, dragging the toes along the ground. Step down with the ball of your foot again. Repeat steps 3 and 4 until you’ve walked the desired distance."
        },
        {
            "id": "Back Hook Spin",
            "category": [
                "spin"
            ],
            "common_mistakes": "Losing Momentum Mid-Spin: If you’re losing momentum in the middle of your spin, make sure that you are keeping your grip on the pole firm, and make sure your knees are not collapsing in when your bring your toes together. Not Starting with Enough Momentum: Lift that leg high – and we mean high – up to your side, and lead with that leg when you fall backwards. The motion of your leg extending out and then leading your body backwards will help you gain momentum. You may also want to video yourself to ensure that you are bringing your feet up simultaneously. Too Much Momentum on Spin Pole: If you are getting too much momentum on spin pole, try reducing how much you “swing” into bent knees when you are falling back. This fast motion of the knees bending can cause you to lose control of your momentum on spin pole. Likewise, try experimenting with bringing your leg down a little lower to reduce how much momentum you get when you begin to fall back. Keep your hand grip strong, and make sure you do not collapse your legs in in the middle of the spin – the further out your body is, the slower you will spin on spin pole.",
            "description": "The Back Hook Spin is the reverse of the Front Hook Spin, however, because of the backwards momentum, it is mechanically different. Both spins are excellent for beginner pole dancers and teach a wide variety of skills on the pole. In this spin, you will need to generate more backwards momentum to bring your body around the pole successfully.",
            "difficulty": "beginner",
            "link": "https://polepedia.com/moves/back-hook-spin/",
            "names": [
                "Back Hook Spin"
            ],
            "points_of_contact": [
                3
            ],
            "prerequisites": [
                "Front Hook Spin",
                "Knee Pit Grip",
                "Anchor Grip",
                "Baseball Grip"
            ],
            "safety_tips": "Don’t hang from your shoulder when you are in this grip. Make sure to keep the shoulders strong through the entire movement.",
            "steps": "Standing next to the pole, wrap your hand and forearm around the pole, gripping in a Baseball grip. Bring the outside hand up, gripping the pole high above your head. Walk your feet out away from the pole to give your body some room to extend. This should also open a “window” between your top arm and the pole so you can freely move your head back and forth. Stand on your tip toes and lift your outside leg up high. Let your body fall back, leading with the outside leg. When the inside knee pit touches the pole, bend both knees so your toes kiss together."
        },
        {
            "id": "Pirouette Variations",
            "category": [
                "transition"
            ],
            "common_mistakes": "Feet Won’t Pivot: It’s important to ensure that you are not just on your tip toes, but your weight is firmly on the ball of the foot. By bringing your weight all onto the ball of the foot, you are giving your body the pivot point it needs to move.",
            "description": "The Pirouette is an eye-catching transition that you can work into almost any pole dance routine; once you feel comfortable with the basic pirouette, you can start experimenting with variations. Here, we show you how to make one handed variations and two pirouette variations that allow you to change sides smoothly.",
            "difficulty": "beginner",
            "link": "https://polepedia.com/moves/pirouette-variations/",
            "names": [
                "Pirouette Variations"
            ],
            "points_of_contact": [
                1,
                2
            ],
            "prerequisites": [
                "Basic Pirouette"
            ],
            "safety_tips": "The top hand should maintain contact with the pole at all times to avoid losing balance.",
            "steps": "Move Steps (Variation #1) One-Handed Variation Stand next to the pole and raise up onto your tip-toes. Place your inside hand high above your head and grip the pole. Pivot on your toes and bring your body toward and under your armpit. Keep your outside hand away from the pole. Simultaneously, extend the fingers of your top hand and let the pole roll over the top of your hand, try to maintain the same distance from the pole to keep your balance. Your top hand should maintain contact with the pole. It will “roll” over as you turn your body, allowing you to grab the pole with the palm at the end of the turn. Move Steps (Variation #2) Palm-Up Variation Stand next to the pole and raise up onto your tip-toes. Place your inside hand high up on the pole. Place your outside hand at about head height, palm towards the ceiling and leave it open. Pivot on the toes of your inside leg, and bring your body away from the pole. As your body moves around to the opposite side, your oustide hand will create a “window” for your face. As you move around, let go with that lower, outside hand. Loosely keep your (higher) inside hand on the pole in this movement. It will “roll” over as your turn your body and allow you to grab the pole again at the end of the turn. Move Steps (Variation #3)Outside Hand Variation This variation requires you to do a full turn to end on the opposite side of the pole – for example, if you started with your right hand as your inside hand, you will end with your left hand as your inside hand.  Stand next to the pole and raise up onto your tip-toes. Keep your inside hand away from the pole. Place your outside hand at about neck height, palm towards the ceiling and leave it open. Pivot on your toes and bring your body toward and under your armpit. Simultaneously, let the pole roll over the palm of your hand, loosely close the hand for balance and control of your pirouette. Your hand should maintain contact with the pole. It will “roll” over as you turn your body, allow you to grab the pole at the end of the turn. Readjust your hand height as needed by sliding it along the pole."
        },
        {
            "id": "Brass Monkey",
            "category": [
                "trick"
            ],
            "common_mistakes": "I’m Struggling to Keep My Knee Grip: If you’re struggling with knee grip on the pole while inverted, make sure your ankles are crossed and locked. Pushing your hips forward will also help you maintain grip in the knee. You should feel secure here. My Inverted Grip Is Slipping: If you can’t hold yourself up in the grip for brass monkey, you may find that engaging the shoulders staying strong throughout the movement helps. If you struggle with this, handstand pushups or shoulder presses can help strengthen this area. You will find that it is the same principle as the inside arm grip; you must squeeze your arm into the pole and not hang loosely from any joints. Your weight should be comfortable to hold in this position.",
            "description": "The Brass Monkey is a great intermediate trick to help you get more comfortable with inverted moves. It presents a comfortable leg-hand style grip to set up a wide range of inverted moves and creates a beautiful transition itself. To get into this move, you need to be comfortable inverting, but you only need to know how to do a proper pole sit and forearm grip shelf to achieve proper form.",
            "difficulty": "intermediate",
            "link": "https://polepedia.com/moves/brass-monkey/",
            "names": [
                "Brass Monkey"
            ],
            "points_of_contact": [
                2
            ],
            "prerequisites": [
                "Pole Sit",
                "Anchor Grip",
                "Forearm Grip Shelf (Holster Grip)"
            ],
            "safety_tips": "Be sure to give yourself some height (two pole climbs at least) with this move because you will be inverted with your arms out. If you don’t give yourself enough room, you may bump your head on the floor. Your ankles should always be crossed once inverted to give you support on the pole. This helps your knee squeeze into the pole and provide extra grip.",
            "steps": "Climb twice up the pole. Get into anchor grip and bring your feet forward into a tilted pole sit. In your pole sit, your hips should be tilted. Your top hip should be the same side as your top arm. Cross the ankles and lean down so that the pole follows the outside of your leg and bum. Keeping the top hand on, slide your hands down the pole and reach down with your bottom hand. Grip the pole with your bottom hand. Once the bottom hand is secure, bring your top hand around in a big circle and push the hips forward. Your bottom hand will become the ‘shelf’, bending at the elbow. The hand you are bringing down will become the new bottom hand, pointing towards the floor. Keep the ankles crossed and hips pushed forward. Keep your shoulders and arms engaged. To exit, reverse the motion and come back into a pole sit, or move into a new trick, or slide your legs down the pole and come into a pole handstand."
        },
        {
            "id": "Basic Invert",
            "category": [
                "invert"
            ],
            "common_mistakes": "Trouble Reaching the Pole with Feet: The tuck invert is a great place to start because you can tuck the knees up and then extend the legs, rather than starting with a straight-leg invert. In either case, your feet are not reaching for the pole, they are reaching past the pole. Once the feet have gone past the pole, then you can hook a kneepit onto the pole or wrap them in an inverted X-grip – or just come back down – whatever comes next for you. Not Enough Strength: If you have plenty of arm and back strength, but inverts are still proving difficult for you, then you might not have enough core strength to tuck the knees in far enough and hold it. Try going back to floor prep exercises. I Get Stuck Rotating: If you feel like you are getting “stuck” while you are rotating your body upside down, make sure that you are leading with your head and chest, looking down and to the back wall then the floor. This will help encourage rotation from the waist pocket and hip. Likewise, make sure that you are really pushing your hips up towards the ceiling when you draw the head back. The movement of the feet and knees coming up will help you lift your hips up, but it will require core strength. Arms Get Stuck: If your arms are getting stuck in an invert, or if you feel like there is a lot of strain on the arms, make sure you are straightening the arms completely when you are lifting the hips up.",
            "description": "The Basic Invert is a highly sought-after milestone in any pole dancer’s journey that unlocks a whole new world of amazing tricks. This may result in rushed achievement, laying a poor foundation for future movement, leading to many pole dancers revisiting their inverts later as they move into Aerial Inverts and other ways of inverting like the shoulder mount.  This move requires a lot of core strength and willingness to move the body upside down quickly, but with the help of invert prep, this can be accomplished safely and quickly.",
            "difficulty": "intermediate",
            "link": "https://polepedia.com/moves/basic-invert/",
            "names": [
                "Basic Invert",
                "Tuck Invert",
                "Invert"
            ],
            "points_of_contact": [
                3
            ],
            "prerequisites": [
                "Stronghold Grip",
                "Waist Pocket Hold"
            ],
            "safety_tips": "Never hang loosely from the arms. Always keep the shoulders down and engaged. Do not try to force the elbows to stay bent when you tilt your head backwards. Straighten the arms as you tilt backwards. Never kip-up or jump into your invert. This is a bad habit that can skip over engaging key muscles to help you in later pole progress. Kipping up expends more energy and can put a lot of unnecessary torque on key muscles. Generally, we recommend that pole dancers focus on floor prep and conditioning exercises for inverts until you can deadlift into your invert, or at least minimize how much you kip-up. When you straighten your arms to bring the hips up, never shift your hand grip or let go with your hands. Keep the hands on the pole at all times.",
            "steps": "Move Steps Standing next to the pole, wrap your inside arm around the pole in a Stronghold Grip. Bring the outside hand directly over the inside hand, pulling the arm down and engaging the shoulder. Stick the booty in front of the pole and rest the hips on it in a Waist Pocket Hold. Tuck your knees to your chest and tilt the head back, looking back towards the wall and look to the floor underneath you. Extend your arms when you rotate the hips up. From here, you can extend the legs, pointing the toes and engaging the leg. Pre-Invert Prep For most pole dancers, achieving a proper invert will take strength and coordination that we don’t normally have coming from normal life. In this video, Sophia will take you through a series of exercises to help you get into the proper invert form later.  Training for your invert on the floor is an excellent way to test your muscles, measure progress, and strengthen the muscles necessary to perform a standing Basic Invert, and later, a straight-leg or Chopper invert, where the legs are straddled the entire way up from the floor.  Floor prep for inverting is safe for first timers and experienced pole dancers alike. It is low impact, easy to follow, and gets you used to the basic body mechanics used in an invert. It will also help you get used to using the legs on the pole, which is an important step in inverted pole tricks."
        },
        {
            "id": "Jamilla",
            "category": [
                "trick"
            ],
            "common_mistakes": "",
            "description": "The Jamilla is a great way to get into several other inverted moves, opening up a world of alternate inverts and new transitions. Many inverted moves can even be transitioned into directly, so there is no need to perform a leg hook between invert and trick, simplifying combos and shortening routine times.",
            "difficulty": "intermediate",
            "link": "https://polepedia.com/moves/jamilla/",
            "names": [
                "Jamilla"
            ],
            "points_of_contact": [
                3
            ],
            "prerequisites": [
                "Pistol Grip",
                "Push – Pull Method"
            ],
            "safety_tips": "Always remember to maintain proper engagement during the push – pull motion. Keeping the shoulders strong will encourage good muscle development and help prevent injuries.",
            "steps": "Standing next to the pole, wrap the outside hand around the pole in front of you at shoulder-height. Bring the inside hand down beside you, wrapping around the pole in a pistol grip. Bring your inside leg up to hip height, pressing the outside of the thigh into the pole.  Push with the bottom arm and pull with the top arm to roll over the top of the thigh and bring the outside leg up. Extend both legs for the complete movement."
        },
        {
            "id": "Shoulder Mount",
            "category": [
                "invert"
            ],
            "common_mistakes": "I Can’t Get My Hips Up: If you are struggling to bring your hips up during the invert, you may benefit from core strength exercises. It may also help to lead with the hips, pushing the hips first towards the ceiling, rather than the legs. I’m Struggling to Lift My Body: If you’re advanced enough to start with shoulder mounts and core strength or upper body strength isn’t an issue, then you may find it beneficial to keep the hips forward in your starting position. In other words, don’t arch the back when you’re leaning against the pole. Keep the hips forward and you’ll have less distance to go to bring them up into your straddle.",
            "description": "The Shoulder Mount is an important step in your pole dancing journey that unlocks a new set of movements and allows you to start putting your own spin on different entrances to inverted moves. While an excellent achievement, the shoulder mount requires a lot of core strength and muscle stability in the cup grip position, and should not be rushed into.",
            "difficulty": "advanced",
            "link": "https://polepedia.com/moves/shoulder-mount/",
            "names": [
                "Shoulder Mount"
            ],
            "points_of_contact": [
                3
            ],
            "prerequisites": [
                "Basic Invert",
                "Cup Grip"
            ],
            "safety_tips": "When getting into cup grip, make sure your hands are close to your head. If they are too high, it can put strain on the elbows and will make the move much more difficult. Be sure to engage your shoulders so you do not hang loosely from the joints. Keep every part of your body engaged and strong throughout the move, including the core, hips, and glutes.",
            "steps": "Standing a step or two in front of the pole, lean back so that your trapezius muscle (located between the shoulder and neck) is against the pole. Bring both hands up close to your head in cup grip. Curl your elbows in and tighten your core, bringing the hips up towards the ceiling, into a straddle. From here, you can either lift your legs onto the pole, or move back down to the floor in a controlled manner."
        },
        {
            "id": "Remi Hold",
            "category": [
                "grip"
            ],
            "common_mistakes": "",
            "description": "The Remi Hold is an advanced, knotted, pretzel-like leg hold provides incredible footing and security in a variety of upright and inverted positions. It is not the most comfortable on the legs, especially on smaller pole diameters, but it is visually impressive",
            "difficulty": "advanced",
            "link": "https://polepedia.com/moves/remi-hold/",
            "names": [
                "Remi Hold"
            ],
            "points_of_contact": [],
            "prerequisites": [
                "Front Ankle Grip",
                "Kneepit Grip"
            ],
            "safety_tips": "Always check the security of your bottom ankle before attempting to utilize this hold in an upright or inverted move. The bottom ankle takes the most weight, so it is important that it is stable and not open to any injury as the rest of the body moves and bodyweight shifts.",
            "steps": "For a right-sided hold, your right leg should be on top, locked into your other knee. For a left-sided hold, your left leg should be on top, locked into your other knee. Using your top leg, lift it as high as possible and wrap it across the pole in a knee pit grip that faces the inside. Lift your bodyweight up with an anchor grip to give your legs some room and keep your weight off the pole. With your bottom leg, bend your knee over the top of the first ankle. Snake the bottom leg back and flex the feet behind the pole. Once you have found the pole, you can point your feet and engage the legs again. From here, you can let go of the pole with your hands and gently ease your bodyweight down."
        }
    ]
}